[
  {
    "release": "1.60.4",
    "html": "<h1 id=\"polar160andpreparingfor20\">Polar 1.60 and Preparing for 2.0</h1>\n<p>Another big release is out to help prepare us for 2.0.  </p>\n<p>Most of the changes here are small features and improving stability.</p>\n<h2 id=\"promptingforpremiumandlockedfeatures\">Prompting for Premium and Locked Features</h2>\n<p>One of the big changes in this release is that we're now requiring that users upgrade for features in premium \nfor which (in the past) we weren't requiring an upgrade. </p>\n<p>This might mean at this point you will need to upgrade to premium if you depend on one of these features. </p>\n<p>As part of 2.0 we're improving the stability of all of our premium features.   </p>\n<h2 id=\"features\">Features</h2>\n<ul>\n<li><p>The sidebar no longer shows the color for the buttons unless you hover over them.  The colors \nare also more muted to help not distract more when using the annotation sidebar. </p></li>\n<li><p>Flashcards stats in the mobile app now work.  This way you can do a review and them immediately see the size of your\nqueue and also the number of tasks completed.</p></li>\n<li><p>Ability to revise the text of a text highlight.  This was requested by a number of users due to some annotations \nhaving hyphens or errors in representation of mathematical formulas. </p></li>\n<li><p>Big refactor of the context menu so that range selection and context menus work properly.</p>\n<ul>\n<li><p>Multi-selection for deletes implemented.   </p></li>\n<li><p>The context menus now have icons </p></li></ul></li>\n<li><p>Ability to remove items from folders via right click</p></li>\n<li><p>Bronze now officially required for reading stats and recommended tags</p></li>\n<li><p>Major refactor of how text selection works using the new modern text layer code in pdf.js which has \nbeen a major complaint since 1.0.  Excited to finally have this fixed!</p></li>\n</ul>\n<h2 id=\"fixes\">Fixes</h2>\n<ul>\n<li><p>Fixed bug where sometimes exceptions were swallowed and not properly reported.</p></li>\n<li><p>Updated Firebase to hopefully fix some bugs with latency and exceptions..</p></li>\n<li><p>Fixed delete dialogs as they were using older code…</p></li>\n<li><p>Merged branch for image optimization.</p></li>\n<li><p>Fixed alignment of headers in the doc repo</p></li>\n<li><p>Fixed bad bug with stats for spaced repetition queue not being computed accurately.</p></li>\n<li><p>Improved performance of doc table when selecting items.</p></li>\n<li><p>The document repository view is now much faster and context menus no longer have a 'gap'\nwhich wouldn't trigger the menu. </p></li>\n<li><p>Now using larger buttons in the UI </p></li>\n<li><p>Show the front + back of cards when we 'show answer'</p></li>\n</ul>"
  }
]
