[
  {
    "release": "1.50.0",
    "html": "<p><img class=\"img-fluid border border-dark rounded\" src=\"https://getpolarized.io//assets/screenshots/2019-11-document-view.png\"></p>\n<h1 id=\"polar150spacedrepetitionbetterincrementalreadingandplansfor20\">Polar 1.50 - Spaced Repetition, Better Incremental Reading and Plans for 2.0</h1>\n<p>Polar 1.50 was just released and will be rolling out to everyone in a staged over the next week.</p>\n<p>This is one of the biggest releases we've had in a long time and will be the foundation for 2.0. </p>\n<h1 id=\"whatsinthisrelease\">What's In This Release</h1>\n<p>Now let's get into what we've changed in this release.</p>\n<h2 id=\"improvedincrementalreadingandspacedrepetition\">Improved Incremental Reading and Spaced Repetition</h2>\n<p>As part of this release we conducted about 30 user interviews and one clear trend was that users needed and wanted a\nbetter mobile experience. </p>\n<p>The previous version of our mobile app was alpha at best and was just meant to be a standby until we had it fully ported\nover to mobile and tablet.</p>\n<p>This is going to take longer than I had hoped but dove tails into the long term of Polar being a spaced repetition platform.</p>\n<p>We've rebuild the mobile app and integrated native flashcard review into Polar directly.</p>\n<p>Anki functionality and sync will keep improving of course and will not be deprecated.  In fact, we have a few more \nfeatures we're working on for Anki and will be enabling them in the coming weeks via feature flags at first.</p>\n<p>There's now a 'start review' button in the annotations view that allows you to review your flashcards directly in Polar.</p>\n<h3 id=\"incrementalreading\">Incremental Reading</h3>\n<p>As part of this we now have incremental reading and review of your annotations on mobile via spaced repetition schedules.</p>\n<p>The intervals for incremental reading are longer for flashcards (1d, 4d, and 8d) and the system was designed to work\nwell with review on the mobile app.</p>\n<h2 id=\"newmobileappredesign\">New Mobile App Redesign</h2>\n<p>As part of the full mobile app redesign the new experience should be completely smooth and ready for production use.</p>\n<p>I want to improve it a bit more to work completely offline.  Firebase has some amazing cache/offline-first features \nwhere queries and data can be written and re-sync'd when you come back online.</p>\n<p>This has interesting opportunities for reviewing your reading and flashcards when not connected to the Internet. </p>\n<h3 id=\"statsforflashcards\">Stats for Flashcards</h3>\n<p><img class=\"img-fluid border border-dark rounded\" src=\"https://i.imgur.com/rjhlQLY.png\"></p>\n<p>This version now adds stats for flashcards including total completed, queue size, etc.</p>\n<h3 id=\"paidonmobile\">Paid on Mobile</h3>\n<p>Mobile flashcard review will be a paid feature in 2.0 when on mobile.  It will work for free on the desktop app\nbut if you want to review on mobile you will need a premium account.</p>\n<h2 id=\"annotationbarcolorupdates\">Annotation Bar color updates</h2>\n<p>The annotation bar now has 5 main colors (up from 3) when selecting text for a highlight.</p>\n<h2 id=\"onlystablefeatures\">Only Stable Features</h2>\n<p>We're going to take the position of only enabling stable features from now on. For new users to Polar this was confusing\nwhen they would see something like groups (even if it had a 'beta' flag on it) and I want them to have a good initial<br />\nexperience.</p>\n<p>From now on we will be enabling new (and not yet ready) features via feature flags that developers or beta testers \ncan turn on manually.</p>\n<h2 id=\"documentationandwebsiteupdates\">Documentation and Website Updates</h2>\n<p>Our documentation is being reworked now to update the changes needed for 2.0.  I'm going to try to get more press for \n2.0 so this will mean a lot of new user seeing Polar for the first time.</p>\n<h2 id=\"fulllistofchangesin15010\">Full List of Changes in 1.50.10</h2>\n<ul>\n<li><p>Statistics now shown for flashcards when the user is using spaced repetition </p></li>\n<li><p>No more hamburger menu in the sidebar.  All options are now flat in the desktop UI and more discoverable.</p></li>\n<li><p>Using proper MacOS system font along with Robot everywhere else including android devices.  </p></li>\n<li><p>New documentation rework and will be improving this long term.</p></li>\n<li><p>Added two more colors to the annotation bar. Was frequently requested by our users so just added it.</p></li>\n<li><p>Flashcards now inherit the text of the annotation when being created to avoid double copy / pasting of text.</p></li>\n<li><p>Mobile now a supported platform and designed for spaced repetition.  This will get us moving on mobile until\nwe can build out a real/full reading platform there.</p></li>\n<li><p>The header and footer in the doc repo is fixed now and don't move as you scroll. </p></li>\n<li><p>Fixed bug with drag and drop and working with items from the second page of results.</p></li>\n<li><p>Flashcard reviewer now integrated along with our normal spaced repetition.</p></li>\n<li><p>Annotation reviewer spaced repetition system finally integrated into Polar</p></li>\n<li><p>More work on mobile including disabling some features when using the app.</p></li>\n<li><p>Active filters are now light blue so that users know they have filters enabled.</p></li>\n<li><p>Color and annotation type filters now work.</p></li>\n<li><p>Fixed bug with the root folders having the wrong counts</p></li>\n</ul>\n<h1 id=\"whatsnextandplansfor20\">What's Next and Plans for 2.0</h1>\n<p>This release is basically the foundation for 2.0.  There are a few more features / changes to make before 2.0 is ready. </p>\n<p>We have to improve our documentation a bit more and we have a few more fixes and changes that are still pending.</p>\n<h2 id=\"updatedannotationsidebar\">Updated Annotation Sidebar</h2>\n<p>I'm looking at improving the annotation sidebar to add features like filtering by text (search basically), tagging documents\ndirectly (vs having to jump back to the document repository), and other options like archiving, etc.  </p>\n<h2 id=\"betterpricingmodels\">Better Pricing Models</h2>\n<p>I'm working on better pricing models for students and those outside the United States in developing countries.  Charging\n$4.99 per month to someone in India/Laos doesn't seem fair considering the differing values of currencies.</p>\n<p>I'm also investigating yearly accounts as I think there's a psychological advantage for students to buy in 1-2 year \nincrements as it seems many people really dislike monthly payments. </p>\n<h2 id=\"betterkeyboardbindings\">Better Keyboard Bindings</h2>\n<p>We're investigating bringing on board better keyboard bindings.  It didn't make it to this release because we have to\ndo a big dependency management update (React) and I wanted to get a stable release out the door.</p>"
  },
  {
    "release": "1.60.4",
    "html": "<h1 id=\"polar160andpreparingfor20\">Polar 1.60 and Preparing for 2.0</h1>\n<p>Another big release is out to help prepare us for 2.0.  </p>\n<p>Most of the changes here are small to moderate features and improving stability but there have also been a lot of library \nupdates too which were important.</p>\n<h2 id=\"promptingforpremiumandlockedfeatures\">Prompting for Premium and Locked Features</h2>\n<p>One of the big changes in this release is that we're now requiring that users upgrade for features in premium \nfor which (in the past) we weren't requiring an upgrade. </p>\n<p>This might mean at this point you will need to upgrade to premium if you depend on one of these features. </p>\n<h2 id=\"features\">Features</h2>\n<ul>\n<li><p>The sidebar no longer shows the color for the buttons unless you hover over them.  The colors \nare also more muted to help not distract more when using the annotation sidebar. </p></li>\n<li><p>Flashcards stats in the mobile app now work.  This way you can do a review and them immediately see the size of your\nqueue and also the number of tasks completed.</p></li>\n<li><p>Ability to revise the text of a text highlight.  This was requested by a number of users due to some annotations \nhaving hyphens or errors in representation of mathematical formulas. </p></li>\n<li><p>Big refactor of the context menu so that range selection and context menus work properly.</p>\n<ul>\n<li><p>Multi-selection for deletes implemented.   </p></li>\n<li><p>The context menus now have icons </p></li></ul></li>\n<li><p>Ability to remove items from folders via right click</p></li>\n<li><p>Bronze now officially required for reading stats and recommended tags</p></li>\n<li><p>Major refactor of how text selection works using the new modern text layer code in pdf.js which has \nbeen a major complaint since 1.0.  Excited to finally have this fixed!</p></li>\n</ul>\n<h2 id=\"fixes\">Fixes</h2>\n<ul>\n<li><p>Fixed issue with Polar builds not working on MacOS Catalina.</p></li>\n<li><p>Upgrade to latest electron-builder so that we can have MacOS Catalina </p></li>\n<li><p>Fixed bug where sometimes exceptions were swallowed and not properly reported.</p></li>\n<li><p>Updated Firebase to hopefully fix some bugs with latency and exceptions..</p></li>\n<li><p>Fixed delete dialogs as they were using older code…</p></li>\n<li><p>Merged branch for image optimization.</p></li>\n<li><p>Fixed alignment of headers in the doc repo</p></li>\n<li><p>Fixed bad bug with stats for spaced repetition queue not being computed accurately.</p></li>\n<li><p>Improved performance of doc table when selecting items.</p></li>\n<li><p>The document repository view is now much faster and context menus no longer have a 'gap'\nwhich wouldn't trigger the menu. </p></li>\n<li><p>Now using larger buttons in the UI </p></li>\n<li><p>Show the front + back of cards when we 'show answer'</p></li>\n</ul>"
  }
]
