[
  {
    "id": "1.50.0",
    "date": "2019-11-11T16:00:00.000Z",
    "title": "Polar 1.50 - Spaced Repetition, Better Incremental Reading and Plans for 2.0",
    "large_image": "https://getpolarized.io//assets/screenshots/2019-11-document-view.png",
    "release": "1.50.0",
    "html": "<p>Polar 1.50 was just released and will be rolling out to everyone in a staged over the next week.</p>\n<p>This is one of the biggest releases we've had in a long time and will be the foundation for 2.0. </p>\n<h1 id=\"whatsinthisrelease\">What's In This Release</h1>\n<p>Now let's get into what we've changed in this release.</p>\n<h2 id=\"improvedincrementalreadingandspacedrepetition\">Improved Incremental Reading and Spaced Repetition</h2>\n<p>As part of this release we conducted about 30 user interviews and one clear trend was that users needed and wanted a\nbetter mobile experience. </p>\n<p>The previous version of our mobile app was alpha at best and was just meant to be a standby until we had it fully ported\nover to mobile and tablet.</p>\n<p>This is going to take longer than I had hoped but dove tails into the long term of Polar being a spaced repetition platform.</p>\n<p>We've rebuild the mobile app and integrated native flashcard review into Polar directly.</p>\n<p>Anki functionality and sync will keep improving of course and will not be deprecated.  In fact, we have a few more \nfeatures we're working on for Anki and will be enabling them in the coming weeks via feature flags at first.</p>\n<p>There's now a 'start review' button in the annotations view that allows you to review your flashcards directly in Polar.</p>\n<h3 id=\"incrementalreading\">Incremental Reading</h3>\n<p>As part of this we now have incremental reading and review of your annotations on mobile via spaced repetition schedules.</p>\n<p>The intervals for incremental reading are longer for flashcards (1d, 4d, and 8d) and the system was designed to work\nwell with review on the mobile app.</p>\n<h2 id=\"newmobileappredesign\">New Mobile App Redesign</h2>\n<p>As part of the full mobile app redesign the new experience should be completely smooth and ready for production use.</p>\n<p>I want to improve it a bit more to work completely offline.  Firebase has some amazing cache/offline-first features \nwhere queries and data can be written and re-sync'd when you come back online.</p>\n<p>This has interesting opportunities for reviewing your reading and flashcards when not connected to the Internet. </p>\n<h3 id=\"statsforflashcards\">Stats for Flashcards</h3>\n<p><img class=\"img-fluid border border-dark rounded\" src=\"https://i.imgur.com/rjhlQLY.png\"></p>\n<p>This version now adds stats for flashcards including total completed, queue size, etc.</p>\n<h3 id=\"paidonmobile\">Paid on Mobile</h3>\n<p>Mobile flashcard review will be a paid feature in 2.0 when on mobile.  It will work for free on the desktop app\nbut if you want to review on mobile you will need a premium account.</p>\n<h2 id=\"annotationbarcolorupdates\">Annotation Bar color updates</h2>\n<p>The annotation bar now has 5 main colors (up from 3) when selecting text for a highlight.</p>\n<h2 id=\"onlystablefeatures\">Only Stable Features</h2>\n<p>We're going to take the position of only enabling stable features from now on. For new users to Polar this was confusing\nwhen they would see something like groups (even if it had a 'beta' flag on it) and I want them to have a good initial<br />\nexperience.</p>\n<p>From now on we will be enabling new (and not yet ready) features via feature flags that developers or beta testers \ncan turn on manually.</p>\n<h2 id=\"documentationandwebsiteupdates\">Documentation and Website Updates</h2>\n<p>Our documentation is being reworked now to update the changes needed for 2.0.  I'm going to try to get more press for \n2.0 so this will mean a lot of new user seeing Polar for the first time.</p>\n<h2 id=\"fulllistofchangesin15010\">Full List of Changes in 1.50.10</h2>\n<ul>\n<li><p>Statistics now shown for flashcards when the user is using spaced repetition </p></li>\n<li><p>No more hamburger menu in the sidebar.  All options are now flat in the desktop UI and more discoverable.</p></li>\n<li><p>Using proper MacOS system font along with Robot everywhere else including android devices.  </p></li>\n<li><p>New documentation rework and will be improving this long term.</p></li>\n<li><p>Added two more colors to the annotation bar. Was frequently requested by our users so just added it.</p></li>\n<li><p>Flashcards now inherit the text of the annotation when being created to avoid double copy / pasting of text.</p></li>\n<li><p>Mobile now a supported platform and designed for spaced repetition.  This will get us moving on mobile until\nwe can build out a real/full reading platform there.</p></li>\n<li><p>The header and footer in the doc repo is fixed now and don't move as you scroll. </p></li>\n<li><p>Fixed bug with drag and drop and working with items from the second page of results.</p></li>\n<li><p>Flashcard reviewer now integrated along with our normal spaced repetition.</p></li>\n<li><p>Annotation reviewer spaced repetition system finally integrated into Polar</p></li>\n<li><p>More work on mobile including disabling some features when using the app.</p></li>\n<li><p>Active filters are now light blue so that users know they have filters enabled.</p></li>\n<li><p>Color and annotation type filters now work.</p></li>\n<li><p>Fixed bug with the root folders having the wrong counts</p></li>\n</ul>\n<h1 id=\"whatsnextandplansfor20\">What's Next and Plans for 2.0</h1>\n<p>This release is basically the foundation for 2.0.  There are a few more features / changes to make before 2.0 is ready. </p>\n<p>We have to improve our documentation a bit more and we have a few more fixes and changes that are still pending.</p>\n<h2 id=\"updatedannotationsidebar\">Updated Annotation Sidebar</h2>\n<p>I'm looking at improving the annotation sidebar to add features like filtering by text (search basically), tagging documents\ndirectly (vs having to jump back to the document repository), and other options like archiving, etc.  </p>\n<h2 id=\"betterpricingmodels\">Better Pricing Models</h2>\n<p>I'm working on better pricing models for students and those outside the United States in developing countries.  Charging\n$4.99 per month to someone in India/Laos doesn't seem fair considering the differing values of currencies.</p>\n<p>I'm also investigating yearly accounts as I think there's a psychological advantage for students to buy in 1-2 year \nincrements as it seems many people really dislike monthly payments. </p>\n<h2 id=\"betterkeyboardbindings\">Better Keyboard Bindings</h2>\n<p>We're investigating bringing on board better keyboard bindings.  It didn't make it to this release because we have to\ndo a big dependency management update (React) and I wanted to get a stable release out the door.</p>"
  },
  {
    "id": "1.60.4",
    "date": "2019-11-20T16:00:00.000Z",
    "title": "Polar 1.60 - Preparing for 2.0",
    "video_embed": "https://www.youtube.com/embed/lc4IHnTKiPU",
    "release": "1.60.4",
    "html": "<p>Another big release is out to help prepare us for 2.0.  </p>\n<p>Most of the changes here are small to moderate features and improving stability but there have also been a lot of library \nupdates too which were important.</p>\n<h2 id=\"promptingforpremiumandlockedfeatures\">Prompting for Premium and Locked Features</h2>\n<p>One of the big changes in this release is that we're now requiring that users upgrade for features in premium \nfor which (in the past) we weren't requiring an upgrade. </p>\n<p>This might mean at this point you will need to upgrade to premium if you depend on one of these features. </p>\n<h2 id=\"features\">Features</h2>\n<ul>\n<li><p>The sidebar no longer shows the color for the buttons unless you hover over them.  The colors \nare also more muted to help not distract more when using the annotation sidebar. </p></li>\n<li><p>Flashcards stats in the mobile app now work.  This way you can do a review and them immediately see the size of your\nqueue and also the number of tasks completed.</p></li>\n<li><p>Ability to revise the text of a text highlight.  This was requested by a number of users due to some annotations \nhaving hyphens or errors in representation of mathematical formulas. </p></li>\n<li><p>Big refactor of the context menu so that range selection and context menus work properly.</p>\n<ul>\n<li><p>Multi-selection for deletes implemented.   </p></li>\n<li><p>The context menus now have icons </p></li></ul></li>\n<li><p>Ability to remove items from folders via right click</p></li>\n<li><p>Bronze now officially required for reading stats and recommended tags</p></li>\n<li><p>Major refactor of how text selection works using the new modern text layer code in pdf.js which has \nbeen a major complaint since 1.0.  Excited to finally have this fixed!</p></li>\n</ul>\n<h2 id=\"fixes\">Fixes</h2>\n<ul>\n<li><p>Fixed issue with Polar builds not working on MacOS Catalina.</p></li>\n<li><p>Upgrade to latest electron-builder so that we can have MacOS Catalina </p></li>\n<li><p>Fixed bug where sometimes exceptions were swallowed and not properly reported.</p></li>\n<li><p>Updated Firebase to hopefully fix some bugs with latency and exceptions..</p></li>\n<li><p>Fixed delete dialogs as they were using older code…</p></li>\n<li><p>Merged branch for image optimization.</p></li>\n<li><p>Fixed alignment of headers in the doc repo</p></li>\n<li><p>Fixed bad bug with stats for spaced repetition queue not being computed accurately.</p></li>\n<li><p>Improved performance of doc table when selecting items.</p></li>\n<li><p>The document repository view is now much faster and context menus no longer have a 'gap'\nwhich wouldn't trigger the menu. </p></li>\n<li><p>Now using larger buttons in the UI </p></li>\n<li><p>Show the front + back of cards when we 'show answer'</p></li>\n</ul>"
  },
  {
    "id": "1.70.4",
    "date": "2019-12-11T16:00:00.000Z",
    "title": "Polar 1.70 - New Folders Sidebar, Improved Saving of Annotations, and Electron 7.0.",
    "release": "1.70.4",
    "html": "<p>Polar 1.70 is out! Lots of big changes in this release!</p>\n<p>I know I promised you guys that we would create a video for each release but I can't create\none for 1.70 just now as I'm trying to rush it out to fix an issue with Google authentication\n(more below).</p>\n<p>Normally emergency releases I will do a small point release but this release changed a great \ndeal and I think it's a reasonable trade-off to get it out the door.</p>\n<h2 id=\"newsidebar\">New Sidebar</h2>\n<h3 id=\"foldertagcreation\">Folder / Tag Creation</h3>\n<p>The sidebar code has been significantly refactored to be far far more usable.  You can read\nmore in-depth about <a href=\"https://getpolarized.io/docs/folders.html\">how folders work in our documentation</a>.</p>\n<p>In a nutshell, we now have more explicit folders which can be created ahead of time by the user.</p>\n<p>This ended up confusing new users as they were confused how to work with tags.  They didn't \nrealize you first had to create tags/folders on documents.</p>\n<p>Now you can just right click the sidebar and click \"Create Folder\" or \"Create Tag\" and you'll \nbe prompted for the value of the new tag, and it will be created.</p>\n<p>Additionally there's a \"+\" dropdown in the sidebar so it's more discoverable for new users.</p>\n<h3 id=\"filtering\">Filtering</h3>\n<p>Now the sidebar code has a filter box at the top where you can type in text to filter \nthe tags shown.  This works really well for selecting a tag that you know by name.</p>\n<p>You can just select the filter, type the tag, then click the tag.</p>\n<p>This became more important as we added improved support for tags and people are creating\nmore and more tags.  We don't want to have tag overload!</p>\n<h2 id=\"savingannotations\">Saving Annotations</h2>\n<p>Many of our users want to take their annotations and save them to external files.  They're \ndoing this to make it easy to share annotations with others but also for scripts or \nmigrating into a document that they might be editing.</p>\n<p>One glaring omission was that the annotation view didn't allow you to save annotations to \na file.</p>\n<p>Now there's a \"…\" to the right where you can click \"Download annotation as\" to save the \nfiles locally.</p>\n<p>I'm trying to migrate away from calling this process \"exporting\" as we don't have a \ncorresponding \"import.\"  The Polar desktop app itself is basically it's own export.</p>\n<p>If you want a raw backup of your data on the desktop app it's already done for you - it's\njust your .polar directory.</p>\n<p>That said, some users have noted some reasonable concern to feel more in charge of their\nbackups.</p>\n<p>I'm going to add an option to perform backups directly in Polar in the future just so \nusers can have more piece of mind that their data is safe.</p>\n<h2 id=\"electron70\">Electron 7.0</h2>\n<p>This release also migrates us to Electron 7.0.  I've been wanting to do this for a while\nbut the Electron releases are usually a big migration.  This was forced on us by a change\nGoogle made with their authentication which blocked Electron releases.</p>\n<p>Electron 7.0 adds a ton of new features for better integration into the OS so this should\nbe an improvement across the board in terms of usability, reliability, etc.</p>\n<h2 id=\"whatsnext\">What's Next</h2>\n<p>Next we're going to focus on a 1.80 release. 2.0 is going to come out soon but I need to \nswitch back to working on mobile support as this is very important for mobile flashcard \nreview. </p>\n<h2 id=\"fullchangelog\">Full Changelog</h2>\n<p>Here's the full changelog for this release:</p>\n<h2 id=\"features\">Features</h2>\n<ul>\n<li><p>Migration to Electron 7.1.4</p></li>\n<li><p>Flagged items are now bold.</p></li>\n<li><p>odd/even coloring in the document list / table.</p></li>\n<li><p>usability: the sidebar has been significantly redesigned</p>\n<ul>\n<li>\"+\" button for adding tags and folders</li>\n<li>context menu for adding tags and folders</li>\n<li>remove tag from docs</li></ul></li>\n<li><p>usability: expand/collapse of folders now works now. </p></li>\n<li><p>UI: better UI filter control.</p></li>\n<li><p>usability: you can now see the folders a file is within in the document repository</p></li>\n<li><p>usability: you can now export annotations from the annotations view.</p></li>\n<li><p>usability: double click of comments or flashcards edits them.</p></li>\n</ul>\n<h2 id=\"fixes\">Fixes</h2>\n<ul>\n<li><p>Fix for Google authentication issues due to exposing Electron in User Agent and confused\nGoogle.</p></li>\n<li><p>Reading and review for older items would fail due to schema changes.</p></li>\n<li><p>ChromeOS is now a desktop platform</p></li>\n<li><p>Upgrade account button now works.  </p></li>\n<li><p>Improved text in suggestions dialog.</p></li>\n<li><p>The user suggestions dialog is centered.</p></li>\n<li><p>usability: Fixed an issue where if the user accidentally hit 'r' the document would rotate and people\ncouldn't figure out how to revert.</p></li>\n</ul>"
  },
  {
    "id": "1.80.10",
    "date": "2019-12-16T16:00:00.000Z",
    "title": "Polar 1.80 - Enhanced Mobile, Spaces within Tags and Special Holiday Offer",
    "release": "1.80.10",
    "html": "<p>We have a new version of Polar out with some really interesting features.</p>\n<p>Further, since holiday season is upon us, we are offering a special 1-year deal for Polar Premium for $19.95. That’s\na 50% discount on the regular price. </p>\n<h1 id=\"holidaydiscount\">Holiday Discount</h1>\n<div class=\"text-center\">\n<img class=\"img-responsive mb-2\" style=\"max-height: 350px\" src=\"https://i.imgur.com/QlytaB8.png\">\n</div>\n<p>We've decided to offer a 1 year license of Polar for just $19.95.  Normally the bronze version of Polar is $4.99 \nper month so this is nearly a $40 savings.  </p>\n<p>I wanted to do this because a number of our student users commented that paying per month was expensive and $4.99 per\nmonth was difficult when you're living out of a dorm and eating ramen noodles.</p>\n<p>When 2.0 arrives, which should land sometime in January, the mobile flashcard review is going to be a premium feature.</p>\n<p>This is a great opportunity to save some money once 2.0 is out the door.</p>\n<p><b>Update: </b> We're going to be extending the discount until Dec 31, 2019 due to the delayed release of 1.80.</p>\n<h1 id=\"mobile\">Mobile</h1>\n<p>The mobile app has been significantly reworked and now feels more like a native app.  Navigation works properly and\nalso works amazingly well on a tablet.</p>\n<p>If you have any feedback on our tablet app please reach out.</p>\n<p>This version will form the basis of our Android app which we plan on shipping in early 2020.</p>\n<h1 id=\"spaceswithintags\">Spaces within Tags</h1>\n<p>Spaces within tags are now fully supported.  This includes both folders and regular tags. </p>\n<p>I was hesitant to add this feature because then our tags wouldn't be compatible with other systems like Twitter but\nso many people requested this functionality that it's probably very important moving forward.</p>\n<h1 id=\"fullchangelog\">Full Changelog</h1>\n<ul>\n<li><p>Fixed bug with tablets now showing the pricing plan</p></li>\n<li><p>removed outline on MacOS for tree nodes on the sidebar.</p></li>\n<li><p>Dramatically improved our mobile and tablet apps.</p></li>\n<li><p>Fixed bug where PHZ files were breaking with iframes that were invalid.</p></li>\n<li><p>Changed #annotations and #stats URLs so that they are /annotations and /stats \nas we're going to migrate to anchors for sub-screens for history.</p></li>\n<li><p>Fixed privacy policy URL in login page</p></li>\n<li><p>Tags can now contain spaces and hyphens</p></li>\n<li><p>Semaphore now used for Windows disk writes.</p></li>\n<li><p>Removed some unused libraries</p></li>\n<li><p>Upgrades to latest firebase</p></li>\n</ul>"
  },
  {
    "id": "1.90.0",
    "date": "2020-01-10T16:00:00.000Z",
    "title": "Polar 1.90 - Improved Tablet/Phone Support and Stability",
    "release": "1.90.0",
    "html": "<p>Polar 1.90 is now available for all desktop users and will be rolling out over the next week.  </p>\n<p>The major changes in this release involve improved mobile support but a ton of stability and bug fixes have gone \ninto the desktop app.</p>\n<h2 id=\"improvedtabletandphonesupport\">Improved Tablet and Phone Support</h2>\n<p>We're steadily improving our tablet and phone support and are hoping that full-document reading will be finished \nin mid february.</p>\n<p>For now, the major functionality includes flashcard and annotation review while on a handheld device.</p>\n<p>We're working on full document management just like the desktop but need a bit more time.  Specifically, features\nlike pagemarks and annotation creation do not work properly on handheld devices.</p>\n<p>Tablet including iPad support has been a big feature request from our users so we really want to nail that\nfeature set.</p>\n<h2 id=\"stability\">Stability</h2>\n<p>This release includes more stability and reliability issues which are now available in the desktop app as well.</p>\n<p>We fixed a major issue with some users logging into Google that prevented them from being unable to authenticate \nin the desktop app.  </p>\n<p>This particularly impacted students at universities which used 3rd party integration with Google auth.</p>\n<h2 id=\"improvedreleasecadence\">Improved Release Cadence</h2>\n<p>Now that the holidays are over we're planning on improving our release cadence and trying to push builds at \nleast once every two weeks.</p>\n<h2 id=\"roadmap\">Roadmap</h2>\n<p>We're also working on releasing a rough roadmap on features for Q1 2020 and that should be out this week.</p>\n<p>Additionally, I have a bit of a surprise for you guys so stay tuned.  </p>\n<h2 id=\"fullchangelog\">Full Changelog</h2>\n<h3 id=\"1900\">1.90.0</h3>\n<ul>\n<li>Suggestions and net promoter score disabled for now as users were complaining\nthat it was asking too often. We're going to disable this until we can make\nsure that users are only asked once per month at most. </li>\n<li>significant improvements with mobile apps and spaced repetition</li>\n<li>Fixed bug with safari not rendering the top left folder filters…</li>\n</ul>\n<h3 id=\"18029\">1.80.29</h3>\n<ul>\n<li>\"Copy clipboard\" from logs now pretty prints the JSON args</li>\n<li>Reworked flashcard app so the flashcards now look like real flashcards.</li>\n<li>Animations now work with the sidebar properly</li>\n<li>Navigations now work on tablet and phone with routes</li>\n<li>Reworked routes so that they're cached + faster plus work with nav</li>\n<li>Fixed bad bug with authentication and Google auth bringing up external URL window/prompts</li>\n</ul>"
  },
  {
    "id": "1.90.18",
    "date": "2020-02-07T16:00:00.000Z",
    "title": "Polar 1.90.18 - Stability Improvements and Auto Pagemarks",
    "release": "1.90.18",
    "html": "<p>Polar 1.90.18 is now available for all desktop users and will be rolling out over the next week.  </p>\n<h2 id=\"stability\">Stability</h2>\n<p>A ton of work has gone into stability to continue improving reliability for users.  </p>\n<h2 id=\"filteringannotationsinsidebar\">Filtering Annotations in Sidebar</h2>\n<p>You can now filter annotations in the sidebar to search by text.  </p>\n<p><img src=\"https://i.imgur.com/Ph4xcM7.png\" class=\"border\" style=\"width: 400px\"></p>\n<h2 id=\"autopagemarks\">Auto Pagemarks</h2>\n<p>We have preview support for auto-pagemarks which are part of our new <a href=\"https://getpolarized.io/docs/new-pagemark-design.html\">pagemark design</a>.</p>\n<p>This will create pagemarks automatically while you naturally read the document.</p>\n<p>You have to enable it in settings (as it's preview for now) and it only supports PDF documents.</p>\n<p>We're going to probably make this the default mode and remove manually sized pagemark boxes as this is a better initial\nuser experience but also resolves some issues with manually resized pagemarks being buggy.</p>\n<h2 id=\"fullchangelog\">Full Changelog</h2>\n<p><strong>1.90.18</strong></p>\n<ul>\n<li>Sentry is now disabled as it was breaking windows builds.</li>\n<li>Flow for the annotation sidebar now fixes the header at the top and \nproperly sets overflow so just the sidebar text flows. </li>\n<li>Short term workaround for a bug where firebase won't write to prefs on \nstartup which blocked cloud sync on restart for some users.</li>\n<li>Upgraded to latest Firebase libraries (7.7.0)</li>\n<li>Fixed bug with spacing in the tree sidebar for nodes that get compressed.</li>\n<li>Ability to filter annotations on the sidebar.</li>\n<li>Fixed bug with performing reviews when nothing left was available.</li>\n<li>Fixed bug with #? not being encoded properly due when creating file URLs.</li>\n</ul>"
  },
  {
    "id": "1.100.13",
    "date": "2020-03-27T16:00:00.000Z",
    "title": "Polar 1.100.13 - Tags for Annotations",
    "release": "1.100.13",
    "html": "<p>Polar 1.100.12 is now available on the web for all desktop users and will be rolling out over the next week.  </p>\n<div class=\"embed-responsive embed-responsive-16by9\">\n<iframe class=\"embed-responsive-item\"  \n        src=\"https://www.youtube.com/embed/6M6jNlairGc\"\n        frameBorder=\"0\"\n        allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"\n        allowFullScreen></iframe>\n</div>\n<h2 id=\"tagsforannotations\">Tags for Annotations</h2>\n<p>The main feature of this release is tags for annotations.  </p>\n<p>This has been frequently requested by users and we finally were able to devote \nthe time to making sure it was implemented properly.</p>\n<h2 id=\"stability\">Stability</h2>\n<p>Of course we've also fixed a number of bugs in this release including a bad one\nthat sometimes prevented the UI from updating when working with annotations.</p>\n<h2 id=\"whatsnext\">What's Next</h2>\n<p>We're working on moving the entire platform over to React including the PDF \nviewer.  Once this is complete we'll be able to quickly finish implementing \nEPUB, dark mode, and some improvements to our chrome extension to enable \nannotation and capture directly in the browser for web content.</p>\n<p>This will also meant that tablet and phone support can come online as 2.0 is \nbeing designed with mobile support in mind.</p>\n<h2 id=\"fullchangelog\">Full Changelog</h2>\n<ul>\n<li>annotations in the annotation view are now sorted by 'last updated' not the\ncreation time.  </li>\n<li>annotations can have tags</li>\n</ul>"
  }
]
